// Щоб вивчити JS необхідно робити домашні роботи І бути присутнім на заняттях

// робити домашні роботи &&  бути присутнім на заняттях

true && false; // false
false && true; // false
true && true; // true
false && false; // false

// Якщо не виконується хоча б одна умова то буде false
// Щоб було true мають виконуватись всі умови

// Я піду гуляти якщо буде хороша погода або в мене є парасолька

// буде хороша погода ||  в мене є парасолька

true || false; // true
false || true; // true
false || false; //false
true || true; //true

// Має виконуватись хоча б одна умова

// && - має завжди отримумвати два true операнди щоб повернути true
// || - має отримувати хоча б одне true щоб повернути true
