// scopes

const a = 10; // global
// const d = 10;
// Все що створюється в фігурних дужках там і залишається, поза межами цих фігурних дужок недоступно
if (a === 10) {
  const d = 10;
  if (d === 10) {
    console.log(d);
    const c = 15;
    if (c === 15) {
      const v = 20;
      console.log(c);
    }
    if (d === 10) {
      //console.log(v); // ERROR
      console.log(c); //
    }
  }
}

{
  const d = 15;
}
// Вспливання

//

// функціональна область бачення
// глобальна

//while(лічильник, авторизація)

let i = 0;

//if дуже схожий на while
// while - ключове слово для створення циклу
// () - умова для виконання циклу
// поки умова виконується цикл працює
//поки умова виконується буде виконуватись той код що у вас записаний у фігурних дужках
// { } - тіло циклу

// while (i < 10) {
//   //   i = i + 1;
//   //   i += 1;
//   i++;
//   console.log(i);
// }

let auth = false;
// ! - не
while (!auth) {
  const password = prompt("Введи пароль");
  if (password === "123456") {
    auth = true;
    alert("Вітаємо вас у системі");
  } else {
    alert("Спробуйте ще раз");
  }
}

// Задачка на високосний рік

// do while (гра вгадай число)
// for (Все інше xD)

//break(lottery , Redirect ), continue(парні не парні)
