// 1)
// Створіть змінну age та присвойте їй своє поточне значення віку.
// Створіть змінну message і використайте інтерполяцію рядків, щоб присвоїти їй рядок "Мені [ваш вік] років".
// Виведіть message в консоль.

// 2
// Створіть змінну name та присвойте їй своє ім'я.
// Створіть змінну age та присвойте їй свій вік.
// Створіть змінну city та присвойте їй назву міста, в якому ви живете.
// За допомогою інтерполяції рядків, створіть змінну bio, яка буде містити рядок у форматі: "Привіт, мене звати [ім'я], мені [вік] років, і я живу в місті [місто]".
// Виведіть bio в консоль.

// 3)
// Створіть змінні num1 та num2 і присвойте їм будь-які числові значення.
// За допомогою інтерполяції рядків, створіть змінну result, яка буде містити рядок у форматі: "Сума чисел [num1] і [num2] дорівнює [сума]", де сума - результат додавання num1 і num2.
// Виведіть result в консоль.

// 4)
// Створіть змінну text та присвойте їй будь-який рядок.
// Використовуючи метод indexOf(), знайдіть індекс першого входження слова "JavaScript" у рядку text і виведіть результат у консоль.
// Якщо слово "JavaScript" присутнє в рядку text, замініть його на "JS" за допомогою методу replace() і виведіть новий рядок у консоль.

// 5)

// Створіть змінну text та присвойте їй будь-який рядок.
// Використовуючи відповідні методи рядків, виконайте наступні операції:

// Виведіть в консоль довжину рядка.
// Виведіть в консоль перші 3 символи з рядка.
// Виведіть в консоль останні 3 символи з рядка.
// Виведіть в консоль рядок в верхньому регістрі.
// Виведіть в консоль рядок в нижньому регістрі.

// 6)

// Створіть змінні radius та pi і присвойте їм значення радіуса кола та числа π.
// За допомогою інтерполяції рядків, створіть змінну circleInfo, яка буде містити рядок у форматі: "Коло з радіусом [radius] має площу [площа], де площа - результат обчислення площі кола за формулою pi * radius^2.
// Виведіть circleInfo в консоль.
