// Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

const myNumber = 1 + 10;
console.log(myNumber);
// Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

const myNull = null;
console.log(myNull);
// null undefined - в чому різниця?

// Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). Після введення імені вивести повідомлення привітання з використанням введеного імені.
// const name = prompt("Введіть імʼя");
console.log("Привіт " + name);

// Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().

// Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

//const isOk = confirm("Чи все ОК?"); // при відміні записується false при погодженні записуєтсья true

// if (isOk) {
//   console.log("дякую за підтвердження!");
// } else {
//   console.log("Дію відмінено!");
// }
// Створити скрипт який виводить спливаюче попередження за допомогою alert(). Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

const input3 = document.getElementById("input3");
const span1 = document.getElementById("span1");
// input = ввід
input3.addEventListener("input", onInput);

function onInput(e) {
  // щоб отримати текстове значення з input ми використовуємо такий html атрибут як value
  //event - що і де відбулося?
  // target - елемент на якому відбулась подія
  //value - HTML атрибут який отримує текстове значення
  const inputValue = e.target.value;
  span1.textContent = inputValue;
  // inputValue - взяли значення інпуту
  // .trim() - обрізали пробіли в початку та кінці рядок
  //.length - отримали довжину рядка(кількість символів)
  if (inputValue.trim().length === 0) {
    span1.textContent = "Hello,user";
  }
}
