//1) Напиши скрипт який при кліку на кнопку буде виводити на екран повідомлення “Hello World!”. Використовуй колбек в вигляді стрілки

//2)Створіть програму, яка генерує випадкове число від 1 до 100. Користувач повинен вгадати число, введенням його в текстове поле. При кліку на кнопку "Перевірити" програма повинна повідомити користувача, чи є їх відповідь правильною.

// 3)Створіть програму, яка відображає повідомлення про те, скільки разів користувач клікнув на сторінці.

//

//

// 4) Напишіть функцію, яка приймає масив чисел і колбек-функцію. Функція повинна застосовувати колбек-функцію до кожного елементу масиву та повертати новий масив, що містить результати застосування колбек-функції до кожного елементу.

const applyCallbackToEachElement = (arr, callback) => {};

const arr = [1, 2, 3, 4, 5];
//   const squareCallback = ;

const result = applyCallbackToEachElement(arr, squareCallback);
console.log(result); // [1, 4, 9, 16, 25]

//5)Розрахунок дисконтної ціни
// Створіть функцію, яка розраховує дисконтну ціну на товар з урахуванням знижки. Функція повинна приймати вартість товару та відсоток знижки як аргументи. Використайте стрілкову функцію та колбек.

const calculateDiscountedPrice = (price, discount, callback) => {};

//   const showDiscountedPrice = ;

calculateDiscountedPrice(100, 10, showDiscountedPrice); // Discounted price: 90
