// Створіть функцію calculateArea, яка приймає радіус кола як аргумент і повертає його площу.Використайте цю функцію для обчислення площі кола з радіусом 5.

// Напишіть функцію processData, яка приймає число та колбек - функцію.Функція processData повинна викликати колбек, передаючи йому квадрат вхідного числа.Створіть колбек - функцію, яка виводить результат в консоль.

// Створіть функцію sum, яка приймає довільну кількість аргументів і повертає їх суму.

// Перепишіть наступну функцію як стрілочну:
// function multiply(a, b) {
//     return a * b;
// }

// Створіть функцію applyOperation, яка приймає два числа та функцію - операцію.Функція applyOperation повинна застосовувати передану операцію до двох чисел та повертати результат.Створіть кілька функцій - операцій(додавання, віднімання, множення) і використайте їх з applyOperation.

// Напишіть функцію createPasswordGenerator, яка приймає набір символів і повертає функцію. Повернена функція при кожному виклику повинна генерувати випадковий пароль заданої довжини, використовуючи символи з набору.

// Створіть функцію greet, яка приймає ім'я користувача та привітання. Якщо привітання не передано, використайте "Привіт" за замовчуванням.
